psql_scripts/sample_scripts/pgbench-scripts/pgbench_run_summary.txt
pgbench (18.0)
transaction type: multiple scripts
scaling factor: 1
query mode: simple
number of clients: 10
number of threads: 5
maximum number of tries: 1
duration: 3600 s
number of transactions actually processed: 91267
number of failed transactions: 0 (0.000%)
latency average = 394.505 ms
latency stddev = 746.738 ms
initial connection time = 395.547 ms
tps = 25.346043 (without initial connection time)
SQL script 1: gen-inventory.sql
 - weight: 10 (targets 32.3% of total)
 - 29135 transactions (31.9% of total)
 - number of transactions actually processed: 29135 (tps = 8.091172)
 - number of failed transactions: 0 (0.000%)
 - latency average = 60.755 ms
 - latency stddev = 55.806 ms
SQL script 2: gen-sales-transactions.sql
 - weight: 4 (targets 12.9% of total)
 - 11958 transactions (13.1% of total)
 - number of transactions actually processed: 11958 (tps = 3.320894)
 - number of failed transactions: 0 (0.000%)
 - latency average = 84.912 ms
 - latency stddev = 63.295 ms
SQL script 3: delete-sales-transaction-line.sql
 - weight: 1 (targets 3.2% of total)
 - 2914 transactions (3.2% of total)
 - number of transactions actually processed: 2914 (tps = 0.809256)
 - number of failed transactions: 0 (0.000%)
 - latency average = 658.126 ms
 - latency stddev = 184.401 ms
SQL script 4: update-customer.sql
 - weight: 4 (targets 12.9% of total)
 - 11788 transactions (12.9% of total)
 - number of transactions actually processed: 11788 (tps = 3.273682)
 - number of failed transactions: 0 (0.000%)
 - latency average = 66.874 ms
 - latency stddev = 55.661 ms
SQL script 5: select-customer.sql
 - weight: 6 (targets 19.4% of total)
 - 17574 transactions (19.3% of total)
 - number of transactions actually processed: 17574 (tps = 4.880530)
 - number of failed transactions: 0 (0.000%)
 - latency average = 29.821 ms
 - latency stddev = 39.952 ms
SQL script 6: top-customers.sql
 - weight: 2 (targets 6.5% of total)
 - 5991 transactions (6.6% of total)
 - number of transactions actually processed: 5991 (tps = 1.663779)
 - number of failed transactions: 0 (0.000%)
 - latency average = 634.355 ms
 - latency stddev = 150.671 ms
SQL script 7: top-selling-products.sql
 - weight: 4 (targets 12.9% of total)
 - 11605 transactions (12.7% of total)
 - number of transactions actually processed: 11605 (tps = 3.222861)
 - number of failed transactions: 0 (0.000%)
 - latency average = 2253.316 ms
 - latency stddev = 390.851 ms